import 'package:get/get.dart';

class Messages extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'en_US': {
          '首页': '首页',
          '曲线图': '曲线图',
          '设置': '设置',
          '电压': '电压',
          '电流': '电流',
          '保存设置': '电流',
          "充电过压值": "充电过压值",
          "放电欠压值": "放电欠压值",
          "充电过流值": "充电过流值",
          "放电过流值": "放电过流值",
          "放电启动值": "放电启动值",
          "过温度保护值": "过温度保护值",
          "低温恢复值": "低温恢复值",
          "继电器延时": "继电器延时",
          "继电器工作模式": "继电器工作模式",
          "上电默认输出": "上电默认输出",
          "温度控制": "温度控制",
          "语言": "语言",
          "定时时间值": "定时时间值",
          "定时模式": "定时模式",
          "充电电流系数微调": "充电电流系数微调",
          "放电电流系数微调": "放电电流系数微调",
          "通讯地址码": "通讯地址码",
          "电流归零值": "电流归零值",
        },
        'zh_CN': {
          '首页': '首页',
          '曲线图': '曲线图',
          '设置': '设置',
          '电压': '电压',
          '电流': '电流',
        },
      };
}
